Ran Plan for dir: `terraform/applications/noteburst` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfprod"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfprod"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfprod"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Read complete after 0s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfprod"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.alert_renotify["idfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-dev-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-int-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfprod"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfprod"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfprod"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-dev"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-int"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfprod"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfprod"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfprod"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.new_unresolved_alert["idfdev"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-data-dev-lsst-cloud" -> null
                  - channel_id = "C07QAQ92RFD" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-data-dev-lsst-cloud" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "idfdev" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904590" -> null
      - name         = "New and Unresolved - idfdev" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.new_unresolved_alert["idfint"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-data-int-lsst-cloud" -> null
                  - channel_id = "C07PW8HP347" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-data-int-lsst-cloud" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "idfint" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904586" -> null
      - name         = "New and Unresolved - idfint" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.new_unresolved_alert["idfprod"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-data-lsst-cloud" -> null
                  - channel_id = "C07QPHLASTB" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-data-lsst-cloud" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "idfprod" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904588" -> null
      - name         = "New and Unresolved - idfprod" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.new_unresolved_alert["usdfdev"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-usdf-rsp-dev" -> null
                  - channel_id = "C07Q818PS21" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-usdf-rsp-dev" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "usdfdev" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904589" -> null
      - name         = "New and Unresolved - usdfdev" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.new_unresolved_alert["usdfint"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-usdf-rsp-int" -> null
                  - channel_id = "C07QAPKULN7" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-usdf-rsp-int" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "usdfint" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904591" -> null
      - name         = "New and Unresolved - usdfint" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.new_unresolved_alert["usdfprod"].sentry_issue_alert.alert will be destroyed
  # (because sentry_issue_alert.alert is not in configuration)
- resource "sentry_issue_alert" "alert" {
      - action_match = "any" -> null
      - actions_v2   = [
          - {
              - slack_notify_service = {
                  - channel    = "#status-usdf-rsp" -> null
                  - channel_id = "C07QAPJ64PM" -> null
                  - name       = "Send a notification to the Rubin Observatory Slack workspace to #status-usdf-rsp" -> null
                  - workspace  = "270749" -> null
                } -> null
            },
        ] -> null
      - conditions   = jsonencode(
            [
              - {
                  - id = "sentry.rules.conditions.first_seen_event.FirstSeenEventCondition"
                },
              - {
                  - id = "sentry.rules.conditions.regression_event.RegressionEventCondition"
                },
              - {
                  - comparisonType = "count"
                  - id             = "sentry.rules.conditions.event_frequency.EventFrequencyCondition"
                  - interval       = "15m"
                  - value          = "0"
                },
            ]
        ) -> null
      - environment  = "usdfprod" -> null
      - filter_match = "any" -> null
      - frequency    = 5 -> null
      - id           = "15904587" -> null
      - name         = "New and Unresolved - usdfprod" -> null
      - organization = "rubin-observatory" -> null
      - project      = "noteburst" -> null
    }

  # module.alert_renotify["idfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfdev",
        ]
    }

  # module.alert_renotify["idfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfint",
        ]
    }

  # module.alert_renotify["idfprod"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfprod",
        ]
    }

  # module.alert_renotify["usdfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfdev",
        ]
    }

  # module.alert_renotify["usdfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfint",
        ]
    }

  # module.alert_renotify["usdfprod"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfprod",
        ]
    }

  # module.new_unresolved_alert["idfdev"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "b3724407-facd-48af-0048-97d0b119a670" -> null
      - input  = "idfdev" -> null
      - output = "idfdev" -> null
    }

  # module.new_unresolved_alert["idfint"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "f49f901f-e1e4-029f-0942-3a6fb0f76b6e" -> null
      - input  = "idfint" -> null
      - output = "idfint" -> null
    }

  # module.new_unresolved_alert["idfprod"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "4eabbb96-3777-6d43-ba63-a077cd3f3923" -> null
      - input  = "idfprod" -> null
      - output = "idfprod" -> null
    }

  # module.new_unresolved_alert["usdfdev"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "6d5426bf-38b1-024a-103b-ae8fdf9a937a" -> null
      - input  = "usdfdev" -> null
      - output = "usdfdev" -> null
    }

  # module.new_unresolved_alert["usdfint"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "d3fd67c9-461f-3e51-aecb-0020b141ead2" -> null
      - input  = "usdfint" -> null
      - output = "usdfint" -> null
    }

  # module.new_unresolved_alert["usdfprod"].module.environment.terraform_data.environment will be destroyed
  # (because terraform_data.environment is not in configuration)
- resource "terraform_data" "environment" {
      - id     = "fa6054b9-423a-c9c1-9369-c64c3657b39a" -> null
      - input  = "usdfprod" -> null
      - output = "usdfprod" -> null
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/applications/noteburst
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://roundtable-dev.lsst.cloud/atlantis/lock?id=lsst-sqre%252Fprodromos%252Fterraform%252Fapplications%252Fnoteburst%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/applications/noteburst
  ```
Plan: 12 to add, 0 to change, 12 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```